nc: 80
ch: 25
in_channels: 25
depth_multiple: 0.67
width_multiple: 0.75

backbone:
  - [-1, 1, Conv, [32, 3, 2]]           # 0  P1/2: 25 -> 32
  - [-1, 1, Conv, [64, 3, 2]]           # 1  P2/4
  - [-1, 2, C2f,  [64, 64, 1, True]]    # 2
  - [-1, 1, Conv, [128, 3, 2]]          # 3  P3/8
  - [-1, 4, C2f,  [128, 128, 2, True]]  # 4
  - [-1, 1, Conv, [256, 3, 2]]          # 5  P4/16
  - [-1, 4, C2f,  [256, 256, 2, True]]  # 6
  - [-1, 1, Conv, [512, 3, 2]]          # 7  P5/32
  - [-1, 2, C2f,  [512, 512, 1, True]]  # 8
  - [-1, 1, SPPF, [512, 5]]             # 9

head:
  - [-1, 1, Conv, [256, 1, 1]]          # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]           # 12
  - [-1, 2, C2f,  [256, 256, 1]]        # 13

  - [-1, 1, Conv, [128, 1, 1]]          # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]           # 16
  - [-1, 2, C2f,  [128, 128, 1]]        # 17

  - [-1, 1, Conv, [128, 3, 2]]          # 18
  - [[-1, 13], 1, Concat, [1]]          # 19
  - [-1, 2, C2f,  [256, 256, 1]]        # 20

  - [-1, 1, Conv, [256, 3, 2]]          # 21
  - [[-1, 9], 1, Concat, [1]]           # 22
  - [-1, 2, C2f,  [512, 512, 1]]        # 23

  - [[17, 20, 23], 1, Detect, [nc]]