# y8_25ch.yaml
nc: 80            # will be overridden by your data.yaml
# ch: 25            # <<< number of input channels (e.g. 25 for 25-channel input)
# in_channels: 25
# channels: 25
depth_multiple: 1.00
width_multiple: 1.00

# scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
#   s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
#   m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
#   l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
#   x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [16, 3, 2]]          # 0-P1/2   (becomes 25→16 due to ch:25)
  - [-1, 1, Conv, [32, 3, 2]]          # 1-P2/4
  - [-1, 1, C2f,  [32, 32, 1, True]]   # 2
  - [-1, 1, Conv, [64, 3, 2]]          # 3-P3/8
  - [-1, 2, C2f,  [64, 64, 2, True]]   # 4
  - [-1, 1, Conv, [128, 3, 2]]         # 5-P4/16
  - [-1, 2, C2f,  [128, 128, 2, True]] # 6
  - [-1, 1, Conv, [256, 3, 2]]         # 7-P5/32
  - [-1, 1, C2f,  [256, 256, 1, True]] # 8
  - [-1, 1, SPPF, [256, 5]]            # 9

head:
  - [-1, 1, Conv, [128, 1, 1]]         # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]          # 12
  - [-1, 1, C2f,  [128, 128, 1]]       # 13

  - [-1, 1, Conv, [64, 1, 1]]          # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]          # 16
  - [-1, 1, C2f,  [64, 64, 1]]         # 17

  - [-1, 1, Conv, [64, 3, 2]]          # 18
  - [[-1, 12], 1, Concat, [1]]         # 19
  - [-1, 1, C2f,  [128, 128, 1]]       # 20

  - [-1, 1, Conv, [128, 3, 2]]         # 21
  - [[-1, 9], 1, Concat, [1]]          # 22
  - [-1, 1, C2f,  [256, 256, 1]]       # 23

  - [[17, 20, 23], 1, Detect, [nc]]    # <<< ONLY [nc] in 8.3.x
