# y8_large_25ch.yaml
# YOLOv8-L architecture, modified to accept 25 input channels
nc: 80
in_channels: 25          # <- first Conv becomes 25 -> 64
depth_multiple: 1.00
width_multiple: 1.00

backbone:
  # [from, n, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0  P1/2:  25 -> 64
  - [-1, 1, Conv, [128, 3, 2]]            # 1  P2/4:  64 -> 128
  - [-1, 3, C2f, [128, True]]             # 2  3x C2f, stays 128
  - [-1, 1, Conv, [256, 3, 2]]            # 3  P3/8:  128 -> 256
  - [-1, 6, C2f, [256, True]]             # 4  6x C2f, stays 256
  - [-1, 1, Conv, [512, 3, 2]]            # 5  P4/16: 256 -> 512
  - [-1, 6, C2f, [512, True]]             # 6  6x C2f, stays 512
  - [-1, 1, Conv, [1024, 3, 2]]           # 7  P5/32: 512 -> 1024
  - [-1, 3, C2f, [1024, True]]            # 8  3x C2f, stays 1024
  - [-1, 1, SPPF, [1024, 5]]              # 9  SPPF

head:
  - [-1, 1, Conv, [512, 1, 1]]            # 10  1024 -> 512
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 6], 1, Concat, [1]]             # 12  cat(512, 512) = 1024
  - [-1, 3, C2f, [512]]                   # 13  3x C2f, -> 512

  - [-1, 1, Conv, [256, 1, 1]]            # 14  512 -> 256
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 4], 1, Concat, [1]]             # 16  cat(256, 256) = 512
  - [-1, 3, C2f, [256]]                   # 17  3x C2f, -> 256

  - [-1, 1, Conv, [256, 3, 2]]            # 18  down: 28x52 -> 14x26
  - [[-1, 13], 1, Concat, [1]]            # 19  cat(256, 512) = 768
  - [-1, 3, C2f, [512]]                   # 20  3x C2f, -> 512

  - [-1, 1, Conv, [512, 3, 2]]            # 21  down: 14x26 -> 7x13
  - [[-1, 9], 1, Concat, [1]]             # 22  cat(512, 1024) = 1536
  - [-1, 3, C2f, [1024]]                  # 23  3x C2f, -> 1024

  - [[17, 20, 23], 1, Detect, [nc]]       # 24  (8.3.x Detect signature)
